rfblue2/pic-disassembler/src/include/p16f1788.inc
;----- PSMC4DBF Bits -----------------------------------------------------
PSMC4DBF0        EQU  H'0000'
PSMC4DBF1        EQU  H'0001'
PSMC4DBF2        EQU  H'0002'
PSMC4DBF3        EQU  H'0003'
PSMC4DBF4        EQU  H'0004'
PSMC4DBF5        EQU  H'0005'
PSMC4DBF6        EQU  H'0006'
PSMC4DBF7        EQU  H'0007'


;----- PSMC4BLKR Bits -----------------------------------------------------
PSMC4BLKR0       EQU  H'0000'
PSMC4BLKR1       EQU  H'0001'
PSMC4BLKR2       EQU  H'0002'
PSMC4BLKR3       EQU  H'0003'
PSMC4BLKR4       EQU  H'0004'
PSMC4BLKR5       EQU  H'0005'
PSMC4BLKR6       EQU  H'0006'
PSMC4BLKR7       EQU  H'0007'


;----- PSMC4BLKF Bits -----------------------------------------------------
PSMC4BLKF0       EQU  H'0000'
PSMC4BLKF1       EQU  H'0001'
PSMC4BLKF2       EQU  H'0002'
PSMC4BLKF3       EQU  H'0003'
PSMC4BLKF4       EQU  H'0004'
PSMC4BLKF5       EQU  H'0005'
PSMC4BLKF6       EQU  H'0006'
PSMC4BLKF7       EQU  H'0007'


;----- PSMC4FFA Bits -----------------------------------------------------
PSMC4FFA0        EQU  H'0000'
PSMC4FFA1        EQU  H'0001'
PSMC4FFA2        EQU  H'0002'
PSMC4FFA3        EQU  H'0003'


;----- PSMC4STR0 Bits -----------------------------------------------------
P4STRA           EQU  H'0000'
P4STRB           EQU  H'0001'


;----- PSMC4STR1 Bits -----------------------------------------------------
P4HSMEN          EQU  H'0000'
P4LSMEN          EQU  H'0001'
P4SSYNC          EQU  H'0007'


;----- STATUS_SHAD Bits -----------------------------------------------------
C_SHAD           EQU  H'0000'
DC_SHAD          EQU  H'0001'
Z_SHAD           EQU  H'0002'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'000F'
       __BADRAM  H'001D'-H'001F'
       __BADRAM  H'008F'
       __BADRAM  H'010F'-H'0110'
       __BADRAM  H'018F'-H'0190'
       __BADRAM  H'0198'
       __BADRAM  H'020F'
       __BADRAM  H'0218'-H'021F'
       __BADRAM  H'028F'-H'0290'
       __BADRAM  H'0294'-H'0297'
       __BADRAM  H'029B'-H'029F'
       __BADRAM  H'030F'-H'0310'
       __BADRAM  H'0314'-H'031F'
       __BADRAM  H'038F'
       __BADRAM  H'039A'-H'039C'
       __BADRAM  H'040C'-H'041F'
       __BADRAM  H'048C'-H'049F'
       __BADRAM  H'050C'-H'0510'
       __BADRAM  H'0512'
       __BADRAM  H'0514'-H'0519'
       __BADRAM  H'051B'-H'051F'
       __BADRAM  H'058C'-H'0590'
       __BADRAM  H'0597'-H'059F'
       __BADRAM  H'060C'-H'061F'
       __BADRAM  H'068C'-H'069F'
       __BADRAM  H'070C'-H'071F'
       __BADRAM  H'078C'-H'079F'
       __BADRAM  H'080C'-H'081F'
       __BADRAM  H'088C'-H'089F'
       __BADRAM  H'090C'-H'091F'
       __BADRAM  H'098C'-H'099F'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0CC0'-H'0CEF'
       __BADRAM  H'0D0C'-H'0D1F'
       __BADRAM  H'0D20'-H'0D6F'
       __BADRAM  H'0D8C'-H'0DAD'
       __BADRAM  H'0DAE'-H'0DEF'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E20'-H'0E6F'
       __BADRAM  H'0E8C'-H'0E90'
       __BADRAM  H'0EB0'
       __BADRAM  H'0ED0'
       __BADRAM  H'0F0C'-H'0F10'
       __BADRAM  H'0F30'-H'0F6F'
       __BADRAM  H'0F8C'-H'0FE3'
       __BADRAM  H'0FEC'

;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1           8007h
;   CONFIG2           8008h
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1         EQU  H'8007'
_CONFIG2         EQU  H'8008'

;----- CONFIG1 Options --------------------------------------------------
_FOSC_LP         EQU  H'FFF8'    ; LP Oscillator, Low-power crystal connected between OSC1 and OSC2 pins
_FOSC_XT         EQU  H'FFF9'    ; XT Oscillator, Crystal/resonator connected between OSC1 and OSC2 pins
_FOSC_HS         EQU  H'FFFA'    ; HS Oscillator, High-speed crystal/resonator connected between OSC1 and OSC2 pins
_FOSC_EXTRC      EQU  H'FFFB'    ; EXTRC oscillator: External RC circuit connected to CLKIN pin
_FOSC_INTOSC     EQU  H'FFFC'    ; INTOSC oscillator: I/O function on CLKIN pin
_FOSC_ECL        EQU  H'FFFD'    ; ECL, External Clock, Low Power Mode (0-0.5 MHz): device clock supplied to CLKIN pin
_FOSC_ECM        EQU  H'FFFE'    ; ECM, External Clock, Medium Power Mode (0.5-4 MHz): device clock supplied to CLKIN pin
_FOSC_ECH        EQU  H'FFFF'    ; ECH, External Clock, High Power Mode (4-32 MHz): device clock supplied to CLKIN pin

_WDTE_OFF        EQU  H'FFE7'    ; WDT disabled
_WDTE_SWDTEN     EQU  H'FFEF'    ; WDT controlled by the SWDTEN bit in the WDTCON register
_WDTE_NSLEEP     EQU  H'FFF7'    ; WDT enabled while running and disabled in Sleep
_WDTE_ON         EQU  H'FFFF'    ; WDT enabled

_PWRTE_ON        EQU  H'FFDF'    ; PWRT enabled
_PWRTE_OFF       EQU  H'FFFF'    ; PWRT disabled

_MCLRE_OFF       EQU  H'FFBF'    ; MCLR/VPP pin function is digital input
_MCLRE_ON        EQU  H'FFFF'    ; MCLR/VPP pin function is MCLR

_CP_ON           EQU  H'FF7F'    ; Program memory code protection is enabled
_CP_OFF          EQU  H'FFFF'    ; Program memory code protection is disabled

_CPD_ON          EQU  H'FEFF'    ; Data memory code protection is enabled
_CPD_OFF         EQU  H'FFFF'    ; Data memory code protection is disabled

_BOREN_OFF       EQU  H'F9FF'    ; Brown-out Reset disabled
_BOREN_SBODEN    EQU  H'FBFF'    ; Brown-out Reset controlled by the SBOREN bit in the BORCON register
_BOREN_NSLEEP    EQU  H'FDFF'    ; Brown-out Reset enabled while running and disabled in Sleep
_BOREN_ON        EQU  H'FFFF'    ; Brown-out Reset enabled

_CLKOUTEN_ON     EQU  H'F7FF'    ; CLKOUT function is enabled on the CLKOUT pin
_CLKOUTEN_OFF    EQU  H'FFFF'    ; CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin

